DataProcessors/Рин1_РаботаСТиповымНаборомМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<DataProcessor>
		<Properties>
			<Name>Рин1_РаботаСТиповымНаборомМатериалов</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТаблицаВыбранных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстаткиНаПроизводстве</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстаткиНаОсновном</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Передано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереданоИтог</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяКалькуляции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиКалькуляции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаСопоставленных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Рин1_СопоставлениеТиповыхНаборовМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>Рин1_СопоставлениеТиповыхНаборовМатериалов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТиповойНаборМатериалов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рин1_ТиповойНаборМатериалов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Рин1_ТипСправочника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>Рин1_ТипСправочника</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаборМатериалов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/Рин1_РаботаСТиповымНаборомМатериалов/Forms/ФормаВыборТиповыхНаборовПередПечатью/Ext/Form/Module.bsl
// + [Rineco], [Киселев А.] [14.12.2021] [Log_Diff][№ 21317], [#ТиповойНаборМатериалов] 
&НаКлиенте
Процедура ОтметитьВсе(Команда)
	УстановитьСнятьОтметки(Истина);
КонецПроцедуры

// + [Rineco], [Киселев А.] [14.12.2021] [Log_Diff][№ 21317], [#ТиповойНаборМатериалов] 
&НаКлиенте
Процедура УстановитьСнятьОтметки(ЗначениеОтметки)
	
	Для Каждого ЭлементСписка Из СписокТиповыхНаборов Цикл 
		ЭлементСписка.Пометка = ЗначениеОтметки;
	КонецЦикла;
	
КонецПроцедуры

// + [Rineco], [Киселев А.] [14.12.2021] [Log_Diff][№ 21317], [#ТиповойНаборМатериалов] 
&НаКлиенте
Процедура УбратьОтметки(Команда)
	УстановитьСнятьОтметки(Ложь);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Рин1_ТиповойНаборМатериалов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Рин1_ТиповойНаборМатериалов КАК Рин1_ТиповойНаборМатериалов
		|ГДЕ
		|	НЕ Рин1_ТиповойНаборМатериалов.ПометкаУдаления
		|	И Рин1_ТиповойНаборМатериалов.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.Рин1_ТипСправочника.НаборМатериалов)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокТиповыхНаборов.Добавить(ВыборкаДетальныеЗаписи.Ссылка,,Истина);
	КонецЦикла;
	
КонецПроцедуры

// + [Rineco], [Киселев А.] [14.12.2021] [Log_Diff][№ 21317], [#ТиповойНаборМатериалов] 
&НаКлиенте
Процедура ОК(Команда)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	СформироватьПечатнуюФормуСервер(ТабличныйДокумент);
	
	ТабличныйДокумент.Показать();
	
КонецПроцедуры

// + [Rineco], [Киселев А.] [14.12.2021] [Log_Diff][№ 21317], [#ТиповойНаборМатериалов] 
&НаСервере
Процедура СформироватьПечатнуюФормуСервер(ТабличныйДокумент)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ОбработкаОбъект.ПолучитьМакет("СписокТиповыхМатериалов");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ОбластьДетальныеЗаписиТиповойНабор = Макет.ПолучитьОбласть("ДетальныеЗаписиТиповойНаборМатериалов");
	ОбластьДетальныеЗаписи = Макет.ПолучитьОбласть("ДетальныеЗаписиНоменклатура");
	
	МассивНаборов = ОбщегоНазначенияКлиентСервер.ОтмеченныеЭлементы(СписокТиповыхНаборов);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Рин1_СопоставлениеТиповыхНаборовМатериалов.ТиповойНаборМатериалов КАК ТиповойНаборМатериалов,
		|	Рин1_СопоставлениеТиповыхНаборовМатериалов.Номенклатура КАК Номенклатура,
		|	Рин1_СопоставлениеТиповыхНаборовМатериалов.Номенклатура.Артикул КАК НоменклатураАртикул,
		|	Рин1_СопоставлениеТиповыхНаборовМатериалов.Порядок КАК Порядок
		|ИЗ
		|	РегистрСведений.Рин1_СопоставлениеТиповыхНаборовМатериалов КАК Рин1_СопоставлениеТиповыхНаборовМатериалов
		|ГДЕ
		|	Рин1_СопоставлениеТиповыхНаборовМатериалов.ТиповойНаборМатериалов В(&МассивНаборов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Рин1_СопоставлениеТиповыхНаборовМатериалов.Порядок
		|ИТОГИ ПО
		|	ТиповойНаборМатериалов";
	
	Запрос.УстановитьПараметр("МассивНаборов", МассивНаборов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТиповойНаборМатериалов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТиповойНаборМатериалов.Следующий() Цикл
		
		ОбластьДетальныеЗаписиТиповойНабор.Параметры.ТиповойНаборМатериалов = ВыборкаТиповойНаборМатериалов.ТиповойНаборМатериалов;
		
		ТабличныйДокумент.Вывести(ОбластьДетальныеЗаписиТиповойНабор);
	
		ВыборкаДетальныеЗаписи = ВыборкаТиповойНаборМатериалов.Выбрать();
		
		Счетчик = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.Порядок % 2 = 0 Тогда
				ОбластьДетальныеЗаписи.Параметры.АртикулПраво = ВыборкаДетальныеЗаписи.НоменклатураАртикул;
				ОбластьДетальныеЗаписи.Параметры.НоменклатураПраво = ВыборкаДетальныеЗаписи.Номенклатура;	
				ТабличныйДокумент.Вывести(ОбластьДетальныеЗаписи);
			Иначе 
				ОбластьДетальныеЗаписи.Параметры.АртикулЛево = ВыборкаДетальныеЗаписи.НоменклатураАртикул;
				ОбластьДетальныеЗаписи.Параметры.НоменклатураЛево = ВыборкаДетальныеЗаписи.Номенклатура;
				
				Если Счетчик = ВыборкаДетальныеЗаписи.Количество() - 1 Тогда
					ОбластьДетальныеЗаписи.Параметры.АртикулПраво = "";
					ОбластьДетальныеЗаписи.Параметры.НоменклатураПраво = "";
					ТабличныйДокумент.Вывести(ОбластьДетальныеЗаписи);
				КонецЕсли;
				
			КонецЕсли;
			
			Счетчик = Счетчик + 1;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры
